
#************************************************ Домашнее задание *****************************************************
#************************************************* ( ПЕРЕМЕННЫЕ ) ******************************************************


#          ------------- Цель: научиться правильно называть переменные и взаимодействовать с ними.------------
#
# Задание №1:

# Напишите 4 переменных которые буду обозначать следующие данные:
#     Название курса (запишите значение 'Python')
#     Количество выполненных ДЗ (запишите значение 12)
# #   Количество затраченных часов (запишите значение 1.5)
#     Время на одно задание (вычислить используя 1 и 2 переменные)
#     Выведите на экран(в консоль), используя переменные, следующую строку:
#
#     Курс: Python, всего задач:12, затрачено часов: 1.5, среднее время выполнения 0.125 часа.
#
# Примечания:
#     Для вывода значений на экран используйте функцию print(a, b, c), где a, b, c - данные которые выводятся на экран.
#     Для названия переменных используйте только: латинские буквы, не начинайте
#     запись с числа, пишите в змеином регистре(разделяя слова символом '_')
#     Пробелы между словами и символами ':' ',' можно ставить на своё усмотрение

#______________________________________________________________________________________________________________________

# Ответ:
# Задание №1:

stage = "Курс: Python"
print(stage)
homework = "Всего задач:12"
print(homework)
number_of_hours = "затрачено часов: 1.5"
print(number_of_hours)
time = "среднее время выполнения"
print(time)
print(1.5 / 12)
print(stage, homework, number_of_hours, time, 1.5 / 12)
#-----------------------------------------------------------------------------------------------------------------------
# D:\Программы\ProjectPyton\BasiesStructures\Scripts\python.exe "D:\Программы\ProjectPyton\Module 1.
# GIT Practice. Basic Data Structures\Variables (Homework).py"
# Курс: Python
# Всего задач:12
# затрачено часов: 1.5
# среднее время выполнения
# 0.125
# Курс: Python Всего задач:12 затрачено часов: 1.5 среднее время выполнения 0.125

# Process finished with exit code 0
#-----------------------------------------------------------------------------------------------------------------------





























